#+AUTHOR: Eddie Groves
#+EXPORT_EXCLUDE_TAGS: noexport
#+PROPERTY: header-args:fish :eval no-export

* Tasks :noexport:
- [ ] Syntax checking in Emacs
- [ ] Formatting in Emacs
- [ ] JQ FZF
- [ ] Emacs syntax for =Runfile=
- [-] Rust
  - [X] rustup
  - [X] Rust LSP =rust-analyzer=
  - [X] (rust +lsp) in Doom Emacs init.el
  - [ ] Hello Weather - rust-weather
    - [ ] Cargo, how to use and install dependencies
    - [ ] https://github.com/seanmonstar/reqwest
- [ ] https://github.com/isamert/jsdoc.el
- [ ] JSDOC syntax highlighting
- [ ] JSDOC lint Typescript types
- [ ] Workspaces - switch to workspace if buffer is in workspace
- [X] LSP mode templates

* Manually installed software

| Name       | Homepage                                           | Description                                                                        | Where      | Updates       |
|------------+----------------------------------------------------+------------------------------------------------------------------------------------+------------+---------------|
| Bitwarden  | https://bitwarden.com                              | Open-source password management service that stores sensitive information.         | App Store  | Automatic     |
| Doom Emacs | https://github.com/doomemacs/doomemacs             | Doom is a configuration framework for GNU Emacs.                                   | git clone  | doom upgrade  |
| Emacs      | https://github.com/d12frosted/homebrew-emacs-plus  | The extensible, customizable GNU text editor.                                      | ./emacs.sh | ./emacs.sh    |
| Firefox    | [[https://www.mozilla.org/en-US/firefox/]]             | Web browser developed by the Mozilla.                                              | Download   | Automatic     |
| Fisher     | https://github.com/jorgebucaran/fisher             | Plugin manager for Fish.                                                           | curl       | fisher update |
| Homebrew   | https://brew.sh                                    | Package manager for MacOS.                                                         | curl       | brew update   |
| Xcode      | https://developer.apple.com/download/applications/ | Xcode includes everything you need to create amazing apps for all Apple platforms. | Download   | Download      |

* Homebrew cask software

#+begin_src bash :colnames '(Name Version Homepage Description) :exports results
declare -a packages=$(rg --no-line-number --only-matching --replace '$1' '^brew install --cask --quiet ([\w-]+)' casks.sh)
for package in $packages
do
  brew info --json=v2 --cask $package | gojq --raw-output '.casks[0] | [ .name[0], .installed, .homepage, .desc ] | @csv'
done
#+end_src

#+RESULTS:
| Name                              |                 Version | Homepage                                   | Description                                                        |
|-----------------------------------+-------------------------+--------------------------------------------+--------------------------------------------------------------------|
| AlDente                           |               1.22.2,42 | https://apphousekitchen.com/               | Menu bar tool to limit maximum charging percentage                 |
| Beyond Compare                    |             4.4.6.27483 | https://www.scootersoftware.com/           | Compare files and folders                                          |
| IINA                              |               1.3.3,138 | https://iina.io/                           | Free and open-source media player                                  |
| Insomnia                          |                   8.1.0 | https://insomnia.rest/                     | HTTP and GraphQL Client                                            |
| JetBrains Toolbox                 |       2.0.4,2.0.4.17212 | https://www.jetbrains.com/toolbox-app/     | JetBrains tools manager                                            |
| Krisp                             |                  2.25.3 | https://krisp.ai/                          | Noise cancelling application                                       |
| Mozilla Firefox Developer Edition |                  latest | https://www.mozilla.org/firefox/developer/ | Web browser                                                        |
| mitmproxy                         |                  10.2.2 | https://mitmproxy.org/                     | Intercept, modify, replay, save HTTP/S traffic                     |
| PowerShell                        |                   7.3.7 | https://github.com/PowerShell/PowerShell   | Command-line shell and scripting language                          |
| Stoplight Studio                  | 2.10.0,8870.git-32fa2af | https://stoplight.io/studio/               | Editor for designing and documenting APIs                          |
| VSCodium                          |            1.82.2.23257 | https://github.com/VSCodium/vscodium       | Binary releases of VS Code without MS branding/telemetry/licensing |
| draw.io Desktop                   |                  22.0.2 | https://www.diagrams.net/                  | Online diagram software                                            |
| iTerm2                            |                  3.4.20 | https://www.iterm2.com/                    | Terminal emulator as alternative to Apple's Terminal app           |

* Homebrew formulae software

#+begin_src bash :colnames '(Name Version Homepage Description) :exports results
declare -a packages=$(rg --no-line-number --only-matching --replace '$1' '^brew install --formulae --quiet ([\w-]+)$' formulae.sh)
for package in $packages
do
  brew info --json=v2 --formulae $package | gojq --raw-output '.formulae[0] | [ .name, .installed[0].version, .homepage, .desc ] | @csv'
done
#+end_src

#+RESULTS:
| Name                   |    Version | Homepage                                       | Description                                                                      |
|------------------------+------------+------------------------------------------------+----------------------------------------------------------------------------------|
| asdf                   |     0.14.0 | https://asdf-vm.com/                           | Extendable version manager with support for Ruby, Node.js, Erlang & more         |
| bat                    |     0.23.0 | https://github.com/sharkdp/bat                 | Clone of cat(1) with syntax highlighting and Git integration                     |
| cmake                  |     3.27.6 | https://www.cmake.org/                         | Cross-platform make                                                              |
| coreutils              |        9.4 | https://www.gnu.org/software/coreutils         | GNU File, Shell, and Text utilities                                              |
| curl                   |      8.5.0 | https://curl.se                                | Get a file from an HTTP, HTTPS or FTP server                                     |
| direnv                 |     2.32.3 | https://direnv.net/                            | Load/unload environment variables based on $PWD                                  |
| entr                   |        5.4 | https://eradman.com/entrproject/               | Run arbitrary commands when files change                                         |
| fd                     |      8.7.0 | https://github.com/sharkdp/fd                  | Simple, fast and user-friendly alternative to find                               |
| fish                   |      3.6.1 | https://fishshell.com                          | User-friendly command-line shell for UNIX-like operating systems                 |
| fzf                    |     0.42.0 | https://github.com/junegunn/fzf                | Command-line fuzzy finder written in Go                                          |
| git                    |     2.42.0 | https://git-scm.com                            | Distributed revision control system                                              |
| gitleaks               |     8.18.0 | https://github.com/zricethezav/gitleaks        | Audit git repos for secrets                                                      |
| gojq                   |    0.12.13 | https://github.com/itchyny/gojq                | Pure Go implementation of jq                                                     |
| hledger                |     1.32.3 | https://hledger.org/                           | Easy plain text accounting with command-line, terminal and web UIs               |
| hunspell               |      1.7.2 | https://hunspell.github.io                     | Spell checker and morphological analyzer                                         |
| kotlin-language-server |      1.3.6 | https://github.com/fwcd/kotlin-language-server | Intelligent Kotlin support for any editor/IDE using the Language Server Protocol |
| kubernetes-cli         |     1.28.2 | https://kubernetes.io/docs/reference/kubectl/  | Kubernetes command-line interface                                                |
| libvterm               |      0.3.2 | http://www.leonerd.org.uk/code/libvterm/       | C99 library which implements a VT220 or xterm terminal emulator                  |
| lsd                    |      1.0.0 | https://github.com/lsd-rs/lsd                  | Clone of ls with colorful output, file type icons, and more                      |
| pandoc                 |      3.1.8 | https://pandoc.org/                            | Swiss-army knife of markup format conversion                                     |
| plantuml               |  1.2023.11 | https://plantuml.com/                          | Draw UML diagrams                                                                |
| pnpm                   |      8.8.0 | https://pnpm.io/                               | Fast, disk space efficient package manager                                       |
| pre-commit             |    3.6.0_1 | https://pre-commit.com/                        | Framework for managing multi-language pre-commit hooks                           |
| ripgrep                |     13.0.0 | https://github.com/BurntSushi/ripgrep          | Search tool like grep and The Silver Searcher                                    |
| run                    |     0.11.2 | https://github.com/TekWizely/run               | Easily manage and invoke small scripts and wrappers                              |
| rust-analyzer          | 2023-10-02 | https://rust-analyzer.github.io/               | Experimental Rust compiler front-end for IDEs                                    |
| shellcheck             |      0.9.0 | https://www.shellcheck.net/                    | Static analysis and lint tool, for (ba)sh scripts                                |
| sqlite                 |     3.45.0 | https://sqlite.org/index.html                  | Command-line interface for SQLite                                                |
| stow                   |      2.3.1 | https://www.gnu.org/software/stow/             | Organize software neatly under a single directory tree (e.g. /usr/local)         |
| tmux                   |     3.3a_3 | https://tmux.github.io/                        | Terminal multiplexer                                                             |
| tree-sitter            |     0.20.8 | https://tree-sitter.github.io/                 | Parser generator tool and incremental parsing library                            |
| wordnet                |      3.1_1 | https://wordnet.princeton.edu/                 | Lexical database for the English language                                        |
| yt-dlp                 | 2023.12.30 | https://github.com/yt-dlp/yt-dlp               | Fork of youtube-dl with additional features and fixes                            |
| zoxide                 |      0.9.2 | https://github.com/ajeetdsouza/zoxide          | Shell extension to navigate your filesystem faster                               |
| davmail                | 6.1.0-3423 | https://davmail.sourceforge.net/               | POP/IMAP/SMTP/Caldav/Carddav/LDAP exchange gateway                               |
| isync                  |    1.4.4_1 | https://isync.sourceforge.io/                  | Synchronize a maildir with an IMAP server                                        |

* npm installed software

#+begin_src bash :colnames '(Name Version Homepage Description) :exports results
declare -a packages=$(rg --no-line-number --only-matching --replace '$1' '^npm install --global ([\w-]+)$' npm.sh)
for package in $packages
do
    installed_version=$(npm ls $package --global --depth=0 --json | gojq --raw-output --arg package $package '.dependencies.[$package].version')
    npm view --json $package | gojq --raw-output --arg installed_version $installed_version '[ .name, $installed_version, .homepage, .description ] | @csv'
done
#+end_src

#+RESULTS:
| Name                         | Version | Homepage                                                       | Description                                                                                         |
|------------------------------+---------+----------------------------------------------------------------+-----------------------------------------------------------------------------------------------------|
| bash-language-server         |   4.7.0 | https://github.com/bash-lsp/bash-language-server#readme        | A language server for Bash                                                                          |
| prettier                     |   2.8.4 | https://prettier.io                                            | Prettier is an opinionated code formatter                                                           |
| pyright                      | 1.1.295 | https://github.com/Microsoft/pyright#readme                    | Type checker for the Python language                                                                |
| typescript                   |   4.9.5 | https://www.typescriptlang.org/                                | TypeScript is a language for application scale JavaScript development                               |
| typescript-language-server   |   3.3.0 |                                                                | Language Server Protocol (LSP) implementation for TypeScript using tsserver                         |
| vscode-langservers-extracted |   4.6.0 | https://github.com/hrsh7th/vscode-langservers-extracted#readme | HTML/CSS/JSON/ESLint language servers extracted from [vscode](https://github.com/Microsoft/vscode). |
| yaml-language-server         |  1.11.0 |                                                                | YAML language server                                                                                |

* pip installed software

#+begin_src bash :colnames '(Name Version Homepage Description) :exports results
pip inspect | gojq --raw-output '.installed.[] | select(.requested) | select(.metadata.name | IN("pip", "setuptools", "wheel") | not) | .metadata | [ .name, .version, .home_page // (.project_url[]? | select(contains("Homepage"))).[10:] // "Unknown", .summary ] | @csv'
#+end_src

#+RESULTS:
| Name        |      Version | Homepage                                | Description                                                                                                        |
|-------------+--------------+-----------------------------------------+--------------------------------------------------------------------------------------------------------------------|
| PyYAML      |        6.0.1 | https://pyyaml.org/                     | YAML parser and emitter for Python                                                                                 |
| black       |       23.9.1 | https://github.com/psf/black            | The uncompromising code formatter.                                                                                 |
| jira        |        3.5.2 | https://github.com/pycontribs/jira      | Python library for interacting with JIRA via REST APIs.                                                            |
| orgparse    | 0.4.20231004 | https://github.com/karlicoss/orgparse   | orgparse - Emacs org-mode parser in Python                                                                         |
| osxphotos   |       0.63.5 | https://github.com/RhetTbull/           | Export photos from Apple's macOS Photos app and query the Photos library database to access metadata about images. |
| pandoc      |        2.4b0 | Unknown                                 | Pandoc Documents for Python                                                                                        |
| prettytable |        3.9.0 | https://github.com/jazzband/prettytable | A simple Python library for easily displaying tabular data in a visually appealing ASCII table format              |
